IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM22_CONTROLSS_G1_EPWM22.xml
	<register id="CONTROLSS_G1_EPWM22_XCMPCTL1" acronym="CONTROLSS_G1_EPWM22_XCMPCTL1" offset="0x400" width="32" description="XCMP Mode Control Register">
		<bitfield id="XCMPB_ALLOC" width="4" begin="11" end="8" resetval="0x0" description="XCMPn register allocation for CMPB: - 0 --> Reserved - 1 --> Reserved - 2 --> Reserved - 3 -->  Reserved - 4 -->  Reserved - 5 --> XCMP5 - 6 --> XCMP5, XCMP6 - 7 --> XCMP5, XCMP6, XCMP7 - 8 --> XCMP5, XCMP6, XCMP7, XCMP8 This register settings will take effect only when XCMPEN==1 And XCMPSPLIT ==1" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="XCMPA_ALLOC" width="4" begin="7" end="4" resetval="0x0" description="XCMPn register allocation for CMPA: - 0 --> No XCMP - 1 --> XCMP1 - 2 --> XCMP1, XCMP2 - 3 --> XCMP1, XCMP2, XCMP3 - 4 --> XCMP1, XCMP2, XCMP3, XCMP4 - 5 --> XCMP1, XCMP2, XCMP3, XCMP4, XCMP5 - 6 --> XCMP1, XCMP2, XCMP3, XCMP4, XCMP5,                         XCMP6 - 7 --> XCMP1, XCMP2, XCMP3, XCMP4, XCMP5,         XCMP6, XCMP7 - 8 --> XCMP1, XCMP2, XCMP3, XCMP4, XCMP5,         XCMP6, XCMP7, XCMP8 This register settings will take effect only when XCMPEN==1 If XCMPSPLIT ==1, this field cannot be greater than 4. If XCMPSPLIT ==1 only lower 3 bits are used in this field." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="XCMPSPLIT" width="1" begin="1" end="1" resetval="0x0" description="XCMP Register Allocation Options:  0 : XCMP1-8 --> CMPA 1 : XCMP1-4 -->CMPA, XCMP5-8  CMPB This register settings will take effect only when XCMPEN==1" range="1" rwaccess="R/W"/> 
		<bitfield id="XCMPEN" width="1" begin="0" end="0" resetval="0x0" description="XCMP Compare Register Operation Enable:  0 XCMP register operation Disabled     [operation compatible to Type-4] 1 XCMP register operation Enabled    [New CMPx registers are effective - section 1.3 details the operation]" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM22_XLOADCTL" acronym="CONTROLSS_G1_EPWM22_XLOADCTL" offset="0x410" width="32" description="XCMP Mode Load Control Register">
		<bitfield id="RPTBUF3CNT" width="3" begin="30" end="28" resetval="0x0" description="Repeat Count Status Shadow Buffer 3: These bits indicate how many times shadow buffer 3 has been be applied before moving to the next buffer I,e, shadow buffer 1. 0,0,0 Shadow buffer reset value with STARTLD and copied to Active register 0,0,1 Shadow buffer applied twice on 2 successive load strobes 0,1,0 Shadow buffer applied thrice on 3 successive load strobes    .    .  1,1,1 Shadow buffer applied 8 times on 8 successive load strobes  These bits reset to zero every time STARTLD is initiated.  More details in section 1.3.3" range="30 - 28" rwaccess="R"/> 
		<bitfield id="RPTBUF3PRD" width="3" begin="26" end="24" resetval="0x0" description="Repeat Count Shadow Buffer 3 : These bits indicate how many times shadow buffer 3 will be applied before moving to the next buffer I,e, shadow buffer 1. 0,0,0 Apply shadow buffer once and move to the next shadow buffer on the following load pulse 0,0,1 Apply shadow buffer twice on 2 successive load strobes and move to the next shadow buffer on the following load pulse 0,1,0 Apply shadow buffer thrice on 3 successive load strobes and move to the next shadow buffer on the following load pulse    .    .  1,1,1 Apply shadow buffer 8 times on 8 successive load strobes and move to the next shadow buffer on the following load pulse  More details in section 1.3.3" range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="RPTBUF2CNT" width="3" begin="22" end="20" resetval="0x0" description="Repeat Count Status Shadow Buffer 2: These bits indicate how many times shadow buffer 2 has been be applied before moving to the next buffer I,e, shadow buffer 1. 0,0,0 Shadow buffer reset value with STARTLD and copied to Active register 0,0,1 Shadow buffer applied twice on 2 successive load strobes 0,1,0 Shadow buffer applied thrice on 3 successive load strobes    .    .  1,1,1 Shadow buffer applied 8 times on 8 successive load strobes  These bits reset to zero every time STARTLD is initiated." range="22 - 20" rwaccess="R"/> 
		<bitfield id="RPTBUF2PRD" width="3" begin="18" end="16" resetval="0x0" description="Repeat Count Shadow Buffer 2 : These bits indicate how many times shadow buffer 2 will be applied before moving to the next buffer I,e, shadow buffer 1. 0,0,0 Apply shadow buffer once and move to the next shadow buffer on the following load pulse 0,0,1 Apply shadow buffer twice on 2 successive load strobes and move to the next shadow buffer on the following load pulse 0,1,0 Apply shadow buffer thrice on 3 successive load strobes and move to the next shadow buffer on the following load pulse    .    .  1,1,1 Apply shadow buffer 8 times on 8 successive load strobes and move to the next shadow buffer on the following load pulse  More details in section 1.3.3" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="SHDWBUFPTR_LOADMULTIPLE" width="2" begin="11" end="10" resetval="0x0" description="Register Load event count: These bits indicate the current shadow buffer in use. 0,0 Reset value 0,1 1 Shadow buffer 1 in use 1,0 2 Shadow buffer 2 in use 1,1 3 Shadow buffer 3 in use  More details in section 1.3.3" range="11 - 10" rwaccess="R"/> 
		<bitfield id="SHDWBUFPTR_LOADONCE" width="2" begin="9" end="8" resetval="0x0" description="Register Load event count: These bits indicate the current shadow buffer in use. 0,0 Reset value 0,1 1 Shadow buffer 1 in use 1,0 2 Shadow buffer 2 in use 1,1 3 Shadow buffer 3 in use  More details in section 1.3.3" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SHDWLEVEL" width="2" begin="5" end="4" resetval="0x0" description="Shadow Register Level Allocation Options: These bits are effective only when XCMPEN is enabled. 0,0 : XXXX Shadow level is set at zero. XXXX Active register is available 0,1 : XXXX Shadow level is set at 1. XXXX_SHDW1 and Active registers are available  1,0 : XXXX Shadow level is set at 1. XXXX_SHDW1, XXXX_SHDW2 and Active registers are available 1,1 : XXXX Shadow level is set at 1. XXXX_SHDW1, XXXX_SHDW2, XXXX_SHDW3 and Active registers are available" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="LOADMODE" width="1" begin="2" end="2" resetval="0x0" description="Load mode selection for Shadow registers: These bits are effective only when XCMPEN is enabled. 0 : [LOADONCE] Load occurs at every load strobe [CNT_Zero or FRCLD] from SHDWn Active registers. And STARTLD is cleared after 1 load strobe. SHDWBUFPTR is not automatically decremented in this case. User would set the SHDWBUFPTR for subsequent loads.  1 : [LOADMULTIPLE] Load occurs at every load strobe [CNT_Zero or FRCLD] from SHDWnActive registers. And STARTLD is cleared after SHDWLEVEL number of load strobes. SHDWBUFPTR decrements by 1 on a load strobe, until the SHDWBUFPTR reaches 1.  More details in section 1.3.3" range="2" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM22_XLOAD" acronym="CONTROLSS_G1_EPWM22_XLOAD" offset="0x418" width="32" description="XCMP Mode Load Enable Register">
		<bitfield id="FRCLD" width="1" begin="1" end="1" resetval="0x0" description="Force reload event in one shot mode : Writing a 1 to this bit turn force one load event at the input of the event pre-scale counter as shown in the diagram below. This bit is intended to be used for testing and/or software force loading of the events in global load mode. Writing of 0 will be ignored.  Always reads back a 0." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="STARTLD" width="1" begin="0" end="0" resetval="0x0" description="Enable reload event : Writing a 1 to this bit turn the one shot latch condition ON. Upon occurrence of a chosen load strobe, one shadow to active reload occurs and the latch will be cleared. Hence writing 1 to this bit would allow load strobe event to pass through and block further strobe events.  Writing of 0 will be ignored.  Always reads back a 0." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM22_EPWMXLINKXLOAD" acronym="CONTROLSS_G1_EPWM22_EPWMXLINKXLOAD" offset="0x41C" width="32" description="Link register across PWM modules">
		<bitfield id="XLOADLINK" width="5" begin="4" end="0" resetval="0x0" description="XLOAD Link Bits: Writes to the XLOAD registers in the ePWM module selected by the following bit selections results in a simultaneous write to the  current ePWM module's XLOAD registers  00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
